app/controllers/meals_controller.rb

INSERT INTO "meals" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dinner"], ["content", "delicious!"], ["created_at", "2017-05-31 07:33:51.844112"], ["updated_at", "2017-05-31 07:33:51.844112"]]
---
  def create
    @meal = Meal.new(meal_params)
    if @meal.save

UPDATE "meals" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "meals"."id" = ?  [["title", nil], ["content", nil], ["updated_at", "2017-05-31 08:19:40.961976"], ["id", 4]]
---
  def update
    if @meal.update(meal_params)

DELETE FROM "meals" WHERE "meals"."id" = ?  [["id", 1]]
---
  def destroy
    @meal.destroy

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_meal
      @meal = Meal.find(params[:id])